app/views/songs/index.html.erb

SELECT "songs".* FROM "songs"
---

<% Song.all.each do |song| %>