app/controllers/artists_controller.rb

INSERT INTO "artists" ("name", "bio", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["name", "My artist name"], ["bio", "My artist bio"], ["created_at", "2016-01-01 19:37:48.904770"], ["updated_at", "2016-01-01 19:37:48.904770"]]
---
    def create
        @artist = Artist.new(artist_params)
        @artist.save

SELECT  "artists".* FROM "artists" WHERE "artists"."id" = ? LIMIT 1  [["id", 1]]
---
    def edit
        @artist = Artist.find(params[:id])

SELECT  "artists".* FROM "artists" WHERE "artists"."id" = ? LIMIT 1  [["id", 1]]
UPDATE "artists" SET "name" = ?, "updated_at" = ? WHERE "artists"."id" = ?  [["name", "My edit"], ["updated_at", "2016-01-01 19:35:26.905590"], ["id", 1]]
---
    def update
        @artist = Artist.find(params[:id])
        @artist.update(artist_params)