app/controllers/genres_controller.rb

  def create
    @genre = Genre.new(genre_params)
    @genre.save
---
INSERT INTO "genres" ("name", "created_at", "updated_at") VALUES (?, ?, ?)  [["name", "My genre name"], ["created_at", "2016-01-01 19:37:25.844912"], ["updated_at", "2016-01-01 19:37:25.844912"]]

  def edit
    @genre = Genre.find(params[:id])
---
SELECT  "genres".* FROM "genres" WHERE "genres"."id" = ? LIMIT 1  [["id", 1]]

  def update
    @genre = Genre.find(params[:id])
    @genre.update(genre_params)
---
SELECT  "genres".* FROM "genres" WHERE "genres"."id" = ? LIMIT 1  [["id", 1]]
UPDATE "genres" SET "name" = ?, "updated_at" = ? WHERE "genres"."id" = ?  [["name", "My edit"], ["updated_at", "2016-01-01 19:35:26.954064"], ["id", 1]]

  def show
    @genre = Genre.find(params[:id])
---
SELECT  "genres".* FROM "genres" WHERE "genres"."id" = ? LIMIT 1  [["id", 1]]