app/controllers/songs_controller.rb

INSERT INTO "songs" ("name", "artist_id", "genre_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["name", "My song name"], ["artist_id", 1], ["genre_id", 1], ["created_at", "2016-01-01 19:36:51.165098"], ["updated_at", "2016-01-01 19:36:51.165098"]]
---
    def create
        @song = Song.new(song_params)
        @song.save

SELECT  "songs".* FROM "songs" WHERE "songs"."id" = ? LIMIT 1  [["id", 1]]
---
    def edit
        @song = Song.find(params[:id])

SELECT  "songs".* FROM "songs" WHERE "songs"."id" = ? LIMIT 1  [["id", 1]]
UPDATE "songs" SET "name" = ?, "updated_at" = ? WHERE "songs"."id" = ?  [["name", "My edit"], ["updated_at", "2016-01-01 19:36:04.206409"], ["id", 1]]
---
    def update
        @song = Song.find(params[:id])
        @song.update(song_params)